src/assets/artifacts/JPetStore/behavior-models/dfg/dfg.dot
digraph {
	graph [bgcolor=white rankdir=LR]
	node [shape=box]
	-2771076642676856348 [label="CREATE TABLE datasource.sequence (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	3439486615631518096 [label="CREATE TABLE ed2a18a9-6e94-490e-9642-feb9d0accea4.sequence (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	8858534229338243990 [label="CREATE index datasource (3)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-4232002368860555743 [label="CREATE index ed2a18a9-6e94-490e-9642-feb9d0accea4 (3)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-2499549734886841575 [label="CREATE table datasource.account (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-4623086456438337449 [label="CREATE table datasource.bannerdata (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-3889784807838813713 [label="CREATE table datasource.category (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-5282496533444876792 [label="CREATE table datasource.inventory (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-652086287260985047 [label="CREATE table datasource.item (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-5288124977002846032 [label="CREATE table datasource.lineitem (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	7575383405707155780 [label="CREATE table datasource.orders (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	151341663106212993 [label="CREATE table datasource.orderstatus (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	4246563875511976436 [label="CREATE table datasource.product (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-327316450881161128 [label="CREATE table datasource.profile (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-6730490459485454305 [label="CREATE table datasource.signon (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-7841230556370938395 [label="CREATE table datasource.supplier (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-4288588016150410172 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.account (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-3340110389285914044 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.bannerdata (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	1768810292833345861 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.category (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	1521733752267808665 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.inventory (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-7259581384362274563 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.item (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	6724686116786421359 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.lineitem (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-3712041556192916350 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.orders (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-8695287885132526354 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.orderstatus (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	7243614524392322859 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.product (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	8854197541215977847 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.profile (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-2877724856304472209 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.signon (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-1235491864327493978 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.supplier (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-5219198722518686869 [label="GET (332)" fillcolor="#B9B9FF" fontsize=12 style=filled]
	341357673543432844 [label="GET /cargocpc/* (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	5441123084916493625 [label="GET /jpetstore/* (22)" fillcolor="#FAFAFF" fontsize=12 style=filled]
	2238352827878869045 [label="GET /jpetstore/*.action (75)" fillcolor="#EFEFFF" fontsize=12 style=filled]
	-8724539666365886201 [label="INSERT datasource.ACCOUNT (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	1987722872906862296 [label="INSERT datasource.LINEITEM (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-4772592945047939448 [label="INSERT datasource.ORDERS (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-3633446648708878441 [label="INSERT datasource.ORDERSTATUS (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-5415133634120284751 [label="INSERT datasource.PROFILE (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	7011326308125562649 [label="INSERT datasource.SIGNON (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-7452672784413506518 [label="INSERT datasource.account (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-1456156286406049219 [label="INSERT datasource.bannerdata (5)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-8675437501560176433 [label="INSERT datasource.category (5)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	879701087713516945 [label="INSERT datasource.inventory (28)" fillcolor="#F9F9FF" fontsize=12 style=filled]
	6014955067372770914 [label="INSERT datasource.item (28)" fillcolor="#F9F9FF" fontsize=12 style=filled]
	-5651177668631605437 [label="INSERT datasource.product (16)" fillcolor="#FBFBFF" fontsize=12 style=filled]
	3866058648863399336 [label="INSERT datasource.profile (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	1833848441037228745 [label="INSERT datasource.sequence (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	6453993598231395223 [label="INSERT datasource.signon (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-2588251647254951327 [label="INSERT datasource.supplier (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-5221457303855628037 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.ACCOUNT (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-7356763430095777583 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.LINEITEM (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-4954453293816994515 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.ORDERS (3)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	2136692201537862242 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.ORDERSTATUS (3)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	2864160517021623565 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.PROFILE (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	1566592581882976884 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.SIGNON (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	1606951289854561386 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.account (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-2649696242544015 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.bannerdata (5)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-7271455323178447014 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.category (5)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-8896691667168406321 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.inventory (28)" fillcolor="#F9F9FF" fontsize=12 style=filled]
	827911732263350759 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.item (28)" fillcolor="#F9F9FF" fontsize=12 style=filled]
	7852073669218095735 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.product (16)" fillcolor="#FBFBFF" fontsize=12 style=filled]
	7375787031053448155 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.profile (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-4841392437102237970 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.sequence (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	1871661687792968277 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.signon (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	5979102656101853140 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.supplier (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-3522175543001946381 [label="POST (476)" fillcolor="#9B9BFF" fontsize=12 style=filled]
	-8838344393815554245 [label="POST /jpetstore/*.action (9)" fillcolor="#FDFDFF" fontsize=12 style=filled]
	5316966211302452802 [label="Response.sendError (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	1682656687814858061 [label="ResponseFacade.sendRedirect (7)" fillcolor="#FDFDFF" fontsize=12 style=filled]
	233913993475066964 [label="SELECT datasource (13)" fillcolor="#FCFCFF" fontsize=12 style=filled]
	4142849016783846517 [label="SELECT datasource.CATEGORY (5)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	6658502644476702427 [label="SELECT datasource.INVENTORY (3)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-5198108708445318838 [label="SELECT datasource.LINEITEM (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	1802401903988785115 [label="SELECT datasource.PRODUCT (9)" fillcolor="#FDFDFF" fontsize=12 style=filled]
	2692938850508506398 [label="SELECT datasource.SEQUENCE (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-2148463450899073958 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4 (6)" fillcolor="#FDFDFF" fontsize=12 style=filled]
	-8096133792841629635 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.CATEGORY (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	5164447732330888659 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.INVENTORY (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-2852301168381041446 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.LINEITEM (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	6790897347176698404 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.PRODUCT (3)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-2456399487026502903 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.SEQUENCE (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-6646275631081163604 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.account (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	2502787567916652516 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.inventory (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-6318154371833037669 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.lineitem (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	5461133925629273818 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.orders (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	4325910451898153981 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.orderstatus (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	804573155264190095 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.profile (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-2969037471754140127 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.sequence (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	2280589302656182479 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.signon (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-95087890588601097 [label="UPDATE datasource.INVENTORY (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	12031794160992081 [label="UPDATE datasource.SEQUENCE (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-4038882430066816613 [label="UPDATE ed2a18a9-6e94-490e-9642-feb9d0accea4.ACCOUNT (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	6862908898129739422 [label="UPDATE ed2a18a9-6e94-490e-9642-feb9d0accea4.INVENTORY (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	7003686469217790781 [label="UPDATE ed2a18a9-6e94-490e-9642-feb9d0accea4.PROFILE (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	4078288236191194987 [label="UPDATE ed2a18a9-6e94-490e-9642-feb9d0accea4.SEQUENCE (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-3922461212613495878 [label="UPDATE ed2a18a9-6e94-490e-9642-feb9d0accea4.SIGNON (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	1602122951218935002 [label="datasource (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-5219198722518686869 -> 341357673543432844 [label=1 fontsize=12 penwidth=1.0]
	-5219198722518686869 -> 5316966211302452802 [label=1 fontsize=12 penwidth=1.0]
	2238352827878869045 -> 1682656687814858061 [label=3 fontsize=12 penwidth=1.533332444445926]
	2238352827878869045 -> 233913993475066964 [label=7 fontsize=12 penwidth=2.599997333337778]
	2238352827878869045 -> 4142849016783846517 [label=2 fontsize=12 penwidth=1.266666222222963]
	2238352827878869045 -> 6658502644476702427 [label=2 fontsize=12 penwidth=1.266666222222963]
	2238352827878869045 -> 1802401903988785115 [label=3 fontsize=12 penwidth=1.533332444445926]
	2238352827878869045 -> 2692938850508506398 [label=1 fontsize=12 penwidth=1.0]
	-8724539666365886201 -> -5415133634120284751 [label=1 fontsize=12 penwidth=1.0]
	-4772592945047939448 -> -3633446648708878441 [label=1 fontsize=12 penwidth=1.0]
	-3633446648708878441 -> 1987722872906862296 [label=1 fontsize=12 penwidth=1.0]
	-5415133634120284751 -> 7011326308125562649 [label=1 fontsize=12 penwidth=1.0]
	7011326308125562649 -> 233913993475066964 [label=1 fontsize=12 penwidth=1.0]
	-8838344393815554245 -> -8724539666365886201 [label=1 fontsize=12 penwidth=1.0]
	-8838344393815554245 -> 233913993475066964 [label=3 fontsize=12 penwidth=1.533332444445926]
	-8838344393815554245 -> 1802401903988785115 [label=1 fontsize=12 penwidth=1.0]
	233913993475066964 -> 1682656687814858061 [label=2 fontsize=12 penwidth=1.266666222222963]
	233913993475066964 -> 6658502644476702427 [label=1 fontsize=12 penwidth=1.0]
	233913993475066964 -> -5198108708445318838 [label=1 fontsize=12 penwidth=1.0]
	233913993475066964 -> 1802401903988785115 [label=5 fontsize=12 penwidth=2.066664888891852]
	6658502644476702427 -> 233913993475066964 [label=1 fontsize=12 penwidth=1.0]
	-5198108708445318838 -> 233913993475066964 [label=1 fontsize=12 penwidth=1.0]
	1802401903988785115 -> 1682656687814858061 [label=2 fontsize=12 penwidth=1.266666222222963]
	1802401903988785115 -> 4142849016783846517 [label=3 fontsize=12 penwidth=1.533332444445926]
	2692938850508506398 -> 12031794160992081 [label=1 fontsize=12 penwidth=1.0]
	-95087890588601097 -> -4772592945047939448 [label=1 fontsize=12 penwidth=1.0]
	12031794160992081 -> -95087890588601097 [label=1 fontsize=12 penwidth=1.0]
	overlap=false
	fontsize=11
}
