src/assets/artifacts/JPetStore/behavior-models/dfg/dfg.mmd
flowchart LR
  _2771076642676856348["CREATE TABLE datasource.sequence (1)"]
  n_3439486615631518096["CREATE TABLE ed2a18a9-6e94-490e-9642-feb9d0accea4.sequence (1)"]
  n_8858534229338243990["CREATE index datasource (3)"]
  _4232002368860555743["CREATE index ed2a18a9-6e94-490e-9642-feb9d0accea4 (3)"]
  _2499549734886841575["CREATE table datasource.account (1)"]
  _4623086456438337449["CREATE table datasource.bannerdata (1)"]
  _3889784807838813713["CREATE table datasource.category (1)"]
  _5282496533444876792["CREATE table datasource.inventory (1)"]
  _652086287260985047["CREATE table datasource.item (1)"]
  _5288124977002846032["CREATE table datasource.lineitem (1)"]
  n_7575383405707155780["CREATE table datasource.orders (1)"]
  n_151341663106212993["CREATE table datasource.orderstatus (1)"]
  n_4246563875511976436["CREATE table datasource.product (1)"]
  _327316450881161128["CREATE table datasource.profile (1)"]
  _6730490459485454305["CREATE table datasource.signon (1)"]
  _7841230556370938395["CREATE table datasource.supplier (1)"]
  _4288588016150410172["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.account (1)"]
  _3340110389285914044["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.bannerdata (1)"]
  n_1768810292833345861["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.category (1)"]
  n_1521733752267808665["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.inventory (1)"]
  _7259581384362274563["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.item (1)"]
  n_6724686116786421359["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.lineitem (1)"]
  _3712041556192916350["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.orders (1)"]
  _8695287885132526354["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.orderstatus (1)"]
  n_7243614524392322859["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.product (1)"]
  n_8854197541215977847["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.profile (1)"]
  _2877724856304472209["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.signon (1)"]
  _1235491864327493978["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.supplier (1)"]
  _5219198722518686869["GET (332)"]
  n_341357673543432844["GET /cargocpc/* (1)"]
  n_5441123084916493625["GET /jpetstore/* (22)"]
  n_2238352827878869045["GET /jpetstore/*.action (75)"]
  _8724539666365886201["INSERT datasource.ACCOUNT (1)"]
  n_1987722872906862296["INSERT datasource.LINEITEM (1)"]
  _4772592945047939448["INSERT datasource.ORDERS (1)"]
  _3633446648708878441["INSERT datasource.ORDERSTATUS (1)"]
  _5415133634120284751["INSERT datasource.PROFILE (1)"]
  n_7011326308125562649["INSERT datasource.SIGNON (1)"]
  _7452672784413506518["INSERT datasource.account (2)"]
  _1456156286406049219["INSERT datasource.bannerdata (5)"]
  _8675437501560176433["INSERT datasource.category (5)"]
  n_879701087713516945["INSERT datasource.inventory (28)"]
  n_6014955067372770914["INSERT datasource.item (28)"]
  _5651177668631605437["INSERT datasource.product (16)"]
  n_3866058648863399336["INSERT datasource.profile (2)"]
  n_1833848441037228745["INSERT datasource.sequence (1)"]
  n_6453993598231395223["INSERT datasource.signon (2)"]
  _2588251647254951327["INSERT datasource.supplier (2)"]
  _5221457303855628037["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.ACCOUNT (1)"]
  _7356763430095777583["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.LINEITEM (2)"]
  _4954453293816994515["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.ORDERS (3)"]
  n_2136692201537862242["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.ORDERSTATUS (3)"]
  n_2864160517021623565["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.PROFILE (1)"]
  n_1566592581882976884["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.SIGNON (1)"]
  n_1606951289854561386["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.account (2)"]
  _2649696242544015["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.bannerdata (5)"]
  _7271455323178447014["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.category (5)"]
  _8896691667168406321["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.inventory (28)"]
  n_827911732263350759["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.item (28)"]
  n_7852073669218095735["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.product (16)"]
  n_7375787031053448155["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.profile (2)"]
  _4841392437102237970["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.sequence (1)"]
  n_1871661687792968277["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.signon (2)"]
  n_5979102656101853140["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.supplier (2)"]
  _3522175543001946381["POST (476)"]
  _8838344393815554245["POST /jpetstore/*.action (9)"]
  n_5316966211302452802["Response.sendError (1)"]
  n_1682656687814858061["ResponseFacade.sendRedirect (7)"]
  n_233913993475066964["SELECT datasource (13)"]
  n_4142849016783846517["SELECT datasource.CATEGORY (5)"]
  n_6658502644476702427["SELECT datasource.INVENTORY (3)"]
  _5198108708445318838["SELECT datasource.LINEITEM (1)"]
  n_1802401903988785115["SELECT datasource.PRODUCT (9)"]
  n_2692938850508506398["SELECT datasource.SEQUENCE (1)"]
  _2148463450899073958["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4 (6)"]
  _8096133792841629635["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.CATEGORY (2)"]
  n_5164447732330888659["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.INVENTORY (1)"]
  _2852301168381041446["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.LINEITEM (1)"]
  n_6790897347176698404["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.PRODUCT (3)"]
  _2456399487026502903["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.SEQUENCE (1)"]
  _6646275631081163604["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.account (2)"]
  n_2502787567916652516["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.inventory (1)"]
  _6318154371833037669["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.lineitem (1)"]
  n_5461133925629273818["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.orders (1)"]
  n_4325910451898153981["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.orderstatus (1)"]
  n_804573155264190095["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.profile (2)"]
  _2969037471754140127["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.sequence (1)"]
  n_2280589302656182479["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.signon (2)"]
  _95087890588601097["UPDATE datasource.INVENTORY (1)"]
  n_12031794160992081["UPDATE datasource.SEQUENCE (1)"]
  _4038882430066816613["UPDATE ed2a18a9-6e94-490e-9642-feb9d0accea4.ACCOUNT (1)"]
  n_6862908898129739422["UPDATE ed2a18a9-6e94-490e-9642-feb9d0accea4.INVENTORY (1)"]
  n_7003686469217790781["UPDATE ed2a18a9-6e94-490e-9642-feb9d0accea4.PROFILE (1)"]
  n_4078288236191194987["UPDATE ed2a18a9-6e94-490e-9642-feb9d0accea4.SEQUENCE (1)"]
  _3922461212613495878["UPDATE ed2a18a9-6e94-490e-9642-feb9d0accea4.SIGNON (1)"]
  n_1602122951218935002["datasource (1)"]
  _5219198722518686869 -->|1| n_341357673543432844
  _5219198722518686869 -->|1| n_5316966211302452802
  n_2238352827878869045 -->|3| n_1682656687814858061
  n_2238352827878869045 -->|7| n_233913993475066964
  n_2238352827878869045 -->|2| n_4142849016783846517
  n_2238352827878869045 -->|2| n_6658502644476702427
  n_2238352827878869045 -->|3| n_1802401903988785115
  n_2238352827878869045 -->|1| n_2692938850508506398
  _8724539666365886201 -->|1| _5415133634120284751
  _4772592945047939448 -->|1| _3633446648708878441
  _3633446648708878441 -->|1| n_1987722872906862296
  _5415133634120284751 -->|1| n_7011326308125562649
  n_7011326308125562649 -->|1| n_233913993475066964
  _8838344393815554245 -->|1| _8724539666365886201
  _8838344393815554245 -->|3| n_233913993475066964
  _8838344393815554245 -->|1| n_1802401903988785115
  n_233913993475066964 -->|2| n_1682656687814858061
  n_233913993475066964 -->|1| n_6658502644476702427
  n_233913993475066964 -->|1| _5198108708445318838
  n_233913993475066964 -->|5| n_1802401903988785115
  n_6658502644476702427 -->|1| n_233913993475066964
  _5198108708445318838 -->|1| n_233913993475066964
  n_1802401903988785115 -->|2| n_1682656687814858061
  n_1802401903988785115 -->|3| n_4142849016783846517
  n_2692938850508506398 -->|1| n_12031794160992081
  _95087890588601097 -->|1| _4772592945047939448
  n_12031794160992081 -->|1| _95087890588601097
  style _2771076642676856348 fill:#FFFFFF
  style n_3439486615631518096 fill:#FFFFFF
  style n_8858534229338243990 fill:#FEFEFF
  style _4232002368860555743 fill:#FEFEFF
  style _2499549734886841575 fill:#FFFFFF
  style _4623086456438337449 fill:#FFFFFF
  style _3889784807838813713 fill:#FFFFFF
  style _5282496533444876792 fill:#FFFFFF
  style _652086287260985047 fill:#FFFFFF
  style _5288124977002846032 fill:#FFFFFF
  style n_7575383405707155780 fill:#FFFFFF
  style n_151341663106212993 fill:#FFFFFF
  style n_4246563875511976436 fill:#FFFFFF
  style _327316450881161128 fill:#FFFFFF
  style _6730490459485454305 fill:#FFFFFF
  style _7841230556370938395 fill:#FFFFFF
  style _4288588016150410172 fill:#FFFFFF
  style _3340110389285914044 fill:#FFFFFF
  style n_1768810292833345861 fill:#FFFFFF
  style n_1521733752267808665 fill:#FFFFFF
  style _7259581384362274563 fill:#FFFFFF
  style n_6724686116786421359 fill:#FFFFFF
  style _3712041556192916350 fill:#FFFFFF
  style _8695287885132526354 fill:#FFFFFF
  style n_7243614524392322859 fill:#FFFFFF
  style n_8854197541215977847 fill:#FFFFFF
  style _2877724856304472209 fill:#FFFFFF
  style _1235491864327493978 fill:#FFFFFF
  style _5219198722518686869 fill:#B9B9FF
  style n_341357673543432844 fill:#FFFFFF
  style n_5441123084916493625 fill:#FAFAFF
  style n_2238352827878869045 fill:#EFEFFF
  style _8724539666365886201 fill:#FFFFFF
  style n_1987722872906862296 fill:#FFFFFF
  style _4772592945047939448 fill:#FFFFFF
  style _3633446648708878441 fill:#FFFFFF
  style _5415133634120284751 fill:#FFFFFF
  style n_7011326308125562649 fill:#FFFFFF
  style _7452672784413506518 fill:#FEFEFF
  style _1456156286406049219 fill:#FEFEFF
  style _8675437501560176433 fill:#FEFEFF
  style n_879701087713516945 fill:#F9F9FF
  style n_6014955067372770914 fill:#F9F9FF
  style _5651177668631605437 fill:#FBFBFF
  style n_3866058648863399336 fill:#FEFEFF
  style n_1833848441037228745 fill:#FFFFFF
  style n_6453993598231395223 fill:#FEFEFF
  style _2588251647254951327 fill:#FEFEFF
  style _5221457303855628037 fill:#FFFFFF
  style _7356763430095777583 fill:#FEFEFF
  style _4954453293816994515 fill:#FEFEFF
  style n_2136692201537862242 fill:#FEFEFF
  style n_2864160517021623565 fill:#FFFFFF
  style n_1566592581882976884 fill:#FFFFFF
  style n_1606951289854561386 fill:#FEFEFF
  style _2649696242544015 fill:#FEFEFF
  style _7271455323178447014 fill:#FEFEFF
  style _8896691667168406321 fill:#F9F9FF
  style n_827911732263350759 fill:#F9F9FF
  style n_7852073669218095735 fill:#FBFBFF
  style n_7375787031053448155 fill:#FEFEFF
  style _4841392437102237970 fill:#FFFFFF
  style n_1871661687792968277 fill:#FEFEFF
  style n_5979102656101853140 fill:#FEFEFF
  style _3522175543001946381 fill:#9B9BFF
  style _8838344393815554245 fill:#FDFDFF
  style n_5316966211302452802 fill:#FFFFFF
  style n_1682656687814858061 fill:#FDFDFF
  style n_233913993475066964 fill:#FCFCFF
  style n_4142849016783846517 fill:#FEFEFF
  style n_6658502644476702427 fill:#FEFEFF
  style _5198108708445318838 fill:#FFFFFF
  style n_1802401903988785115 fill:#FDFDFF
  style n_2692938850508506398 fill:#FFFFFF
  style _2148463450899073958 fill:#FDFDFF
  style _8096133792841629635 fill:#FEFEFF
  style n_5164447732330888659 fill:#FFFFFF
  style _2852301168381041446 fill:#FFFFFF
  style n_6790897347176698404 fill:#FEFEFF
  style _2456399487026502903 fill:#FFFFFF
  style _6646275631081163604 fill:#FEFEFF
  style n_2502787567916652516 fill:#FFFFFF
  style _6318154371833037669 fill:#FFFFFF
  style n_5461133925629273818 fill:#FFFFFF
  style n_4325910451898153981 fill:#FFFFFF
  style n_804573155264190095 fill:#FEFEFF
  style _2969037471754140127 fill:#FFFFFF
  style n_2280589302656182479 fill:#FEFEFF
  style _95087890588601097 fill:#FFFFFF
  style n_12031794160992081 fill:#FFFFFF
  style _4038882430066816613 fill:#FFFFFF
  style n_6862908898129739422 fill:#FFFFFF
  style n_7003686469217790781 fill:#FFFFFF
  style n_4078288236191194987 fill:#FFFFFF
  style _3922461212613495878 fill:#FFFFFF
  style n_1602122951218935002 fill:#FFFFFF
  linkStyle 0 stroke-width:1px
  linkStyle 1 stroke-width:1px
  linkStyle 2 stroke-width:1.533332444445926px
  linkStyle 3 stroke-width:2.599997333337778px
  linkStyle 4 stroke-width:1.266666222222963px
  linkStyle 5 stroke-width:1.266666222222963px
  linkStyle 6 stroke-width:1.533332444445926px
  linkStyle 7 stroke-width:1px
  linkStyle 8 stroke-width:1px
  linkStyle 9 stroke-width:1px
  linkStyle 10 stroke-width:1px
  linkStyle 11 stroke-width:1px
  linkStyle 12 stroke-width:1px
  linkStyle 13 stroke-width:1px
  linkStyle 14 stroke-width:1.533332444445926px
  linkStyle 15 stroke-width:1px
  linkStyle 16 stroke-width:1.266666222222963px
  linkStyle 17 stroke-width:1px
  linkStyle 18 stroke-width:1px
  linkStyle 19 stroke-width:2.066664888891852px
  linkStyle 20 stroke-width:1px
  linkStyle 21 stroke-width:1px
  linkStyle 22 stroke-width:1.266666222222963px
  linkStyle 23 stroke-width:1.533332444445926px
  linkStyle 24 stroke-width:1px
  linkStyle 25 stroke-width:1px
  linkStyle 26 stroke-width:1px
